tutorials/waterInjectionInDeformableMaterials/0/epss
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epss;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

boundaryField
{
    innerWall
    {
        type            zeroGradient;
    }
    outerWall
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


internalField   nonuniform List<scalar> 
49920
(
0.597243381
0.57669326
0.671006596
0.612664555
0.622118594
0.545552205
0.589079932
0.698528421
...
)
;



// ************************************************************************* //
