tutorials/waterInjectionInDeformableMaterials/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//1 the represents wetting phase, and 2 represents the nonwetting phase
phases (wetting nonWetting);


//air is wetting, water is nonwetting
wetting
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.76e-05;
    rho             [1 -3 0 0 0 0 0] 1;
}
nonWetting
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1e-06;
    rho             [1 -3 0 0 0 0 0] 1000;
}

//thermal properties
// kg m s K mol A cd
kappa_1           [1 1 -3 -1 0 0 0]  0.0257; //air heat conductivity
Cp_1           [0 2 -2 -1 0 0 0]  1000; //air specific heat capacity
kappa_2           [1 1 -3 -1 0 0 0]  0.6; //water heat conductivity
Cp_2           [0 2 -2 -1 0 0 0]  4186; //water specific heat capacity

kappa_s           [1 1 -3 -1 0 0 0]  1; //solid heat conductivity
Cp_s           [0 2 -2 -1 0 0 0]  1350; //solid specific heat capacity
rho_s           [1 -3 0 0 0 0 0]  2650; //solid density

//density of wetting phase (air)
coeff1           [1 -3 0 -2 0 0 0]  1.6613e-5; 
coeff2           [1 -3 0 -1 0 0 0]  -1.3840e-2; 
coeff3           [1 -3 0 0 0 0 0]  3.8333; 
//density of nonwetting phase (water)
coeff4           [1 -3 0 -2 0 0 0]  -3.5313e-3; 
coeff5           [1 -3 0 -1 0 0 0]  1.8517; 
coeff6           [1 -3 0 0 0 0 0]  7.5847e2; 
//dynamic viscosity of wetting phase (air)
coeff7           [1 -1 -1 -2 0 0 0]  -3.5032e-11; 
coeff8           [1 -1 -1 -1 0 0 0]  6.8511e-8; 
coeff9           [1 -1 -1 0 0 0 0]  1.0532e-6; 
//dynamic viscosity of nonwetting phase (water)
coeff10          [1 -1 -1 -2 0 0 0]  1.8357e-7; 
coeff11          [1 -1 -1 -1 0 0 0]  -1.3104e-4; 
coeff12          [1 -1 -1 0 0 0 0]  2.3706e-2; 



//Choose solid rheology model
transportModel  HerschelBulkleyQuemada; 
   
    HerschelBulkleyQuemadaCoeffs
    {
	    nu0      [ 0 2 -1 0 0 0 0 ] 1e05; //shear viscocity at low stresses      
        tau0     [ 0 2 -2 0 0 0 0 ] 0.22; //yield stres
	    epssMax  [ 0 0 0 0 0 0 0 ] 0.74; //maximum porosity
        nuf        [ 0 2 -1 0 0 0 0 ] 1e-6; //minumum viscocity 
	    Dstar    [ 0 0 0 0 0 0 0 ] 1.1; //fractar coefficient
        n        [ 0 0 0 0 0 0 0 ] 1; //power law coefficient
    }     

activateSolidMechanics         1; //activate solid mechanics?
activateCapillarity            1; //activate capillary model?
activatePorousContactAngle     0; //activate porous contact angle?
theta0                         45; //porous contact angle
activateSwellingPressure       0; //activate swelling pressure?
activateTemperatureDependenceOfProperties  1; //activate temperature dependence for viscosity and density
activateTemperatureDependenceOfCapillarity  1; //activate temperature dependence for capillary pressure
activateTemperatureDependenceOfPermeability  1; //activate temperature dependence for absolute permeability
activatePressureDependenceOfDensityForWettingPhase 1; // activate pressure dependence of density using the ideal gas law for wetting phase
activatePressureDependenceOfDensityForNonWettingPhase 0; // activate pressure dependence of density using the ideal gas law for nonwetting phase

// Volume viscosity and swelling correction parameters
kappaDyn0      [1 -1 -1 0 0 0 0]   0;    // Base dynamic bulk viscosity [Pa·s]
mCompaction    [0 0 0 0 0 0 0]     2;    // Compaction exponent [-]
Ks          [1 -1 -2 0 0 0 0]     3e7;    // // Bulk modulus of solid

// Temperature dependence coefficient
sigma            [1 0 -2 0 0 0 0]  0.072; //surface tension
invFk0           [0 -2 0 0 0 0 0]  4.88e6; //2D correction 
T0               [0 0 0 1 0 0 0]   300; //ambient temperature
coeffSigma       [0 0 0 -1 0 0 0]  -2.4743e-3; //change rate of surface tension as a function of temperature

//irriducible saturation
alpha.wettingmin           alpha.wettingmin [0  0  0 0 0 0 0] 0;
//maximum saturation
alpha.wettingmax           alpha.wettingmax [0  0  0 0 0 0 0] 0.999;


relativePermeabilityModel  VanGenuchten;
capillarityModel           VanGenuchten;

VanGenuchtenCoeffs
{
    alpha.wettingminpc alpha.wettingminpc [0 0 0 0 0 0 0] 0;
    alpha.wettingmaxpc alpha.wettingmaxpc [0 0 0 0 0 0 0] 0.999;
    pc0 pc0 [1 -1 -2 0 0 0 0] 0;
    m 0.8;
}



// ************************************************************************* //
